# ============================================================
#  КОНФИГУРАЦИЯ БОТА «VS Где Топливо»
# ============================================================

import os
BOT_TOKEN = os.environ.get("BOT_TOKEN", "")


# ============================================================
#  НАСТРОЙКИ ПОИСКА
# ============================================================

DEFAULT_RADIUS_KM = 5
MAX_RADIUS_KM = 30


# ============================================================
#  МАРКИ ТОПЛИВА
# ============================================================

FUEL_TYPES = [
    "АИ-92",
    "АИ-95",
    "АИ-95+",
    "АИ-98",
    "АИ-100",
    "ДТ",
    "GAS",
]


# ============================================================
#  УСЛУГИ НА ЗАПРАВКАХ
# ============================================================

SERVICES = {
    "car_wash": "🚿 Мойка",
    "cafe": "☕ Кафе",
    "toilet": "🚻 Туалет",
    "shop": "🛒 Магазин",
    "tire_pump": "💨 Подкачка шин",
}

SERVICES_LIST = [
    ("car_wash", "🚿 Мойка"),
    ("cafe", "☕ Кафе"),
    ("toilet", "🚻 Туалет"),
    ("shop", "🛒 Магазин"),
    ("tire_pump", "💨 Подкачка шин"),
]


# ============================================================
#  ГОРОДА ДЛЯ ПОИСКА
# ============================================================

CITIES = [
    "Серпухов",
    "Чехов",
    "Кременки",
    "Протвино",
    "Пущино",
    "Ступино",
    "Подольск",
    "Трасса А-108",
    "Трасса М-2",
]

# ============================================================
#  ГОРОДА ДЛЯ ДОБАВЛЕНИЯ ЗАПРАВОК
# ============================================================

CITIES_FOR_ADD = [
    "Серпухов",
    "Чехов",
    "Кременки",
    "Протвино",
    "Пущино",
    "Ступино",
    "Подольск",
    "Трасса А-108",
    "Трасса М-2",
]